# name = input("имя ")   Переменная!
# print("привет", name,sep=" ")
# if name == 'Сергей' :
#    print("вы-студент")

# Login = input("Ведите логин: ")
# password = input("Придумайте пароль: ")
# password_confirm = input("Повтарите пароль: ")
# if password == password_confirm:
#    print(Login, ",успешная регистрация.")
# else:
#     print("ошибка")


# print('Hello, ' + '"world"') # string
# print(5 > 10, 10 > 5)   # False,True - boolean
# print(1, 2, 3, 4, 'hello world', True ) - запятая разеляет типы языка в задаче
# print(5 >= 5, 5 <= 5, 5 == 5, 5 != 5)
# print(5 != 5 and 5 < 10) # если один неверен то ответ false
# print(5 != 5 or 5 < 10) # если один верный то ответ True

# int - число, str - текст, bool - логика, float - дробные числа.

# print(int('5')) - перевод по типам чтения языка

# n = 23891471923807487.142352314353455
# a = 23891471923843245.142352314334563
# d = 23891471923807487.142352314356734
# s = 23891471923843245.142352314334553
# print(n - a > d - s)
# n = 23891471923807487.142352314353455 + 23891471923843245.142352314334563
# a = 23891471923807487.142352314356734 + 23891471923843245.142352314334553
# print(n>a)

# a = int(input('число'))
# d = int(input('число'))
# print('результат: ', a + d)
# print('результат: ', a - d)
# print('результат: ', a * d)
# print('результат: ', a // d)
# print('результат: ', a ** d)


# a = 'Привет '
# print(a * 2)







